DELETE FROM `Sport club`.`previous trainers`;
DELETE FROM `Sport club`.`sportsmen`;
DELETE FROM `Sport club`.`trainers`;
DELETE FROM `Sport club`.`sports`;

ALTER TABLE `Sport club`.`trainers` AUTO_INCREMENT = 1;

INSERT INTO `Sport club`.`sports` (`name`, `type`) VALUES
	('фигурное катание', 'парный'), ('легкая атлетика', 'индивидуальный'),
    ('художественная гимнастика', 'индивидуальный'), ('теннис', 'парный'),
    ('танцы', 'парный'), ('дартс', 'индивидуальный');
    
INSERT INTO `Sport club`.`trainers` (`full_name`, `sport`, `skill_level`, `rating`) VALUES
	('Татьяна Тарасова', 'фигурное катание', 'МС', 1),#1
    ('Нагиев Дмитрий', 'легкая атлетика', 'МС', 3),#2
    ('Кабаева Алина', 'художественная гимнастика', 'МС', 100),#3
    ('Мария Шарапова', 'теннис', 'МС', 15),#4
    ('Губмерт Гумберт', 'теннис', 'МС', 13),#5
    ('Николай Цискаридзе', 'танцы', 'МС', 1),#6
    ('Фил Тейлор', 'Дартс', 'КМС', 37),#7
    ('Джон Фэйлор', 'легкая атлетика', 'КМС', 150);#8
    
INSERT INTO `Sport club`.`sportsmen` (`certificate_number`, `full_name`, `birth_date`,
									  `sex`, `skill_level`, `trainer`, `rating`, `partner`,
                                      `address`, `mobile_phone`, `home_phone`, `registration_date`) VALUES
	(123456, 'Евгений Плющенко', '1950-01-02', 'м', 'Юниор', 1, 1, 289410, 'Москва', '+79154320158', '84902324588', CURDATE()),
    (289410, 'Татьяна Навка', '1970-05-07', 'ж', 'Юниор', 1, 9, 123456, 'Москва', '+79158920157', NULL, CURDATE()),
    (975319, 'Усэйн Болт', '1990-05-07', 'м', 'МС', 2, 3, NULL, 'Ямайка', NULL, '84902324588', CURDATE()),
    (123789, 'Маша Иванова', '1996-06-07', 'ж', 'КМС', 3, 2, NULL, 'Петербург', '+79154320149', '84902324588', CURDATE()),
    (678123, 'Мартын Эдельвейс', '1900-05-07', 'м', 'Юниор', 4, 1, 789123, 'Петроград', NULL, NULL, CURDATE()),
    (789123, 'Лолита Гейз', '1940-09-07', 'ж', 'КМС', 5, 1, 678123, 'Петроград', '+79154320139', '84902324588', CURDATE()),
    (789456, 'Майя Плисецкая', '1690-05-07', 'ж', 'Юниор', 6, 1, 456788, 'Москва', '+79164320157', '84902324588', CURDATE()),
    (456789, 'Рудольф Нуреев', '1965-05-07', 'м', 'МС', 6, 3, 789455, 'Ямайка', NULL, '84902324588', CURDATE()),
    (604581, 'Робин Гуд', '1690-05-07', 'м', 'КМС', 7, 10, NULL, 'Британия', NULL, NULL, CURDATE());
    
INSERT INTO `Sport club`.`previous trainers` (`trainer`, `sportsman`, `start_date`, `finish_date`) VALUES
	(6, 975319, '2002-08-11', '2005-08-11'),
    (3, 975319, '2002-08-11', '2005-08-11'),
    (1, 789123, '2002-08-11', '2005-08-11'),
    (4, 456789, '2002-08-11', '2005-08-11');